tanakamasayuki/ESP32IRPulseKit/src/codec/Decoder.h
          if (decode_len > header_syms + trailer_syms)
          {
            size_t bit_syms = decode_len - header_syms - trailer_syms;
            bool last_is_space = ((decode_len % 2) == 0); // mark-first streams end on space when a gap is present
            if (last_is_space && (bit_syms % 2) != 0)
            {
              bool gap_candidate = (spec.gap_threshold_us == 0);
              uint32_t tail_us = detail::ticksToUs(raw.ticks[decode_len - 1]);
              if (!gap_candidate)
                gap_candidate = tail_us >= spec.gap_threshold_us;
              if (gap_candidate)
                --decode_len;
            }
          }
        }

        IRRawTickView sub_raw = raw;
        sub_raw.len = decode_len;

        ok = detail::decodeNormal(sub_raw, spec, decoded, score);
        if (!ok && spec.has_repeat)
        {
          ok = detail::decodeRepeat(sub_raw, spec, decoded, score);
        }
      }
      else if (spec.scheme == IRProtocolScheme::BIPHASE)
      {
        switch (spec.protocol_id)
        {
        case IRProtocolID::RC5:
          ok = rc_detail::decodeRC5(raw, spec, decoded, score);
          break;
        case IRProtocolID::RC6_M0_16:
          ok = rc_detail::decodeRC6M0(raw, spec, decoded, score);
          break;
        case IRProtocolID::RC6_M6_32:
          ok = rc_detail::decodeRC6M6(raw, spec, decoded, score);
          break;
        default:
          ok = false;
          break;
        }
      }

      if (!ok)
        continue;

      IRDecodeCandidate cand{};
      cand.protocol_id = decoded.protocol_id;
      if (spec.name[0] != '\0')
      {
        std::strncpy(cand.name, spec.name, sizeof(cand.name) - 1);
        cand.name[sizeof(cand.name) - 1] = '\0';
      }
      cand.order = spec.order;
      cand.consumed_len = effective_len;
      cand.score = score;
      cand.decoded = decoded;
      detail::adjustFamilyScore(spec, cand.decoded, cand.score);
      if (cand.score < score_threshold)
        continue;
      detail::insertCandidate(out, max_candidates, cand);
    }

    if (out.count > 0)
    {
      size_t consumed = out.candidates[0].consumed_len > 0 ? out.candidates[0].consumed_len
                                                           : out.raw.len;
      if (consumed < out.raw.len)
        out.raw.len = consumed;
    }

    return out.count > 0;
  }

} // namespace esp32irpk::codec
